CSI API ETABS v1

# cAreaObjGetMass Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetMass(
    	string Name,
    	ref double MassOverL2
    )

    Function GetMass (
    	Name As String,
    	ByRef MassOverL2 As Double
    ) As Integer

    Dim instance As cAreaObj
    Dim Name As String
    Dim MassOverL2 As Double
    Dim returnValue As Integer

    returnValue = instance.GetMass(Name, MassOverL2)

    int GetMass(
    	String^ Name,
    	double% MassOverL2
    )

    abstract GetMass :
            Name : string *
            MassOverL2 : float byref -> int

#### Parameters

Name

    Type: SystemString

MassOverL2

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cAreaObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com